Catalogs/НастройкиНалоговойДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>НастройкиНалоговойДекларации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СтрокиОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаголовок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнакГруппы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПлюсМинус</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>160</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПлюсМинус</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньИтога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложительноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПлюсМинус</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиНалоговойДекларации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройки() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиНалоговойДекларации;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	// Заполнение НастройкиСтрок.
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		СчетУчета = СокрЛП(СтрокаТаблицыЗначений.СчетУчета);
		Формула = СокрЛП(СтрокаТаблицыЗначений.Формула);
		Знак = СокрЛП(СтрокаТаблицыЗначений.Знак);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		// Пропуск не настраеваемых строк.
		Если ВРег(ЭтоЗаголовок) = "ИСТИНА"
			Или Формула = "" Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = НастройкиСтрок.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетУчета);
		СтрокаТабличнойЧасти.Формула = ?(ЗначениеЗаполнено(Формула), Перечисления.Формулы[Формула], Перечисления.Формулы.ПустаяСсылка());
		СтрокаТабличнойЧасти.Знак = ?(ЗначениеЗаполнено(Знак), Перечисления.ПлюсМинус[Знак], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, ЭтоЗаголовок");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
	КонецЦикла;
	
	ЗаполнитьКлючиСвязи("НастройкиСтрок");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКлючиСвязи(ИмяПодчиненнойТабличнойЧасти)

	// Формирование ключа связи.
	КлючСвязи = 1;
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОтчета Цикл 
		СтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		НайденныеСтроки = ЭтотОбъект[ИмяПодчиненнойТабличнойЧасти].НайтиСтроки(Новый Структура("КодСтроки", СтрокаТабличнойЧасти.КодСтроки));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.КлючСвязи = КлючСвязи;
		КонецЦикла;	
		
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;	

КонецПроцедуры // ЗаполнитьКлючСвязи()
	
#КонецОбласти

#КонецЕсли
